{
    "user_name": "Mateusz Idziejczak",
    "user_email": "mateusz.idziejczak@gmail.com",
    "user_linkedin": "linkedin.com/in/mateusz-idziejczak-a2aa65248",
    "user_location": "Poznan, Poland",
    "user_title": "AI & Machine Learning Engineer",
    "user_details_text": " EXPERIENCE\n LIMS Expert\n Global Pharma Solutions\n 2021 – Present\n • Provide expert-level support for global users of Laboratory Information Management Systems (LIMS),\n resolving complex user tickets and ensuring system functionality.\n • Manage the creation and updates of LIMS Master Data, including specifications, sampling plans, and LES\n worksheets, ensuring accuracy and compliance.\n • Collaborate closely with Quality Control (QC) departments to collect, verify, and integrate critical\n laboratory data into the LIMS environment.\n • Develop and maintain comprehensive compliance documentation, routing for approval and ensuring\n adherence to GxP and global regulatory standards.\n • Participate actively in user training programs and contribute to the development of best practices and\n process improvements within the LIMS ecosystem.\n Quality Control Analyst\n BioTech Innovations\n 2017 – 2021\n • Performed hands-on analytical techniques, including HPLC, in a GxP-regulated laboratory setting,\n ensuring data integrity and adherence to protocols.\n • Utilized LIMS for sample tracking, data entry, and results management, supporting routine QC operations.\n • Contributed to the development and validation of analytical methods, ensuring compliance with internal\n and external standards.\n PROJECTS\n LIMS System Optimization & Enhancement\n 2022\n • Led a cross-functional project to optimize LIMS workflows and integrate new modules, improving data\n processing efficiency by 15%.\n • Configured and implemented advanced LIMS functionalities for specific analytical techniques and\n reporting requirements.\n • Provided training and ongoing support to laboratory personnel, fostering user adoption and proficiency.\n GxP Documentation Automation Initiative\n 2020\n• Developed automated templates and streamlined processes for GxP compliance documentation, reducing\n manual effort and improving turnaround times.\n • Ensured all generated documentation met stringent global regulatory standards and internal quality\n requirements.\n • Collaborated with quality assurance teams to implement digital signature workflows within the document\n management system.\n Analytical Method Integration into LIMS\n 2019\n • Successfully integrated new and revised analytical methods (e.g., HPLC) into the LIMS, configuring\n necessary specifications and sampling plans.\n • Conducted thorough testing and validation of the integrated methods within LIMS to ensure accuracy and\n compliance.\n • Collaborated with R&D; and QC teams to ensure seamless data flow and reporting capabilities"
}